smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
// *****************************************************************************
//
// Project: PFPP
//
// Module: BSP.
//
// *****************************************************************************

//! \file
//! \brief BSP class.
//! \ingroup application_bsp

// *****************************************************************************
//
//        Copyright (c) 2016-2022, Martin Garon, All rights reserved.
//
// *****************************************************************************

// *****************************************************************************
//                              INCLUDE FILES
// *****************************************************************************

#include <array>

// QP Library.
#include "qpcpp.h"

// CMSIS Library.
#include "TM4C129ENCPDT.h"

// TI Library.
//#define TARGET_IS_BLIZZARD_RA1
//#define DTARGET_IS_SNOWFLAKE_RA0
//#define PART_TM4C129ENCPDT
#include <inc/hw_ints.h>
//#include "inc/hw_memmap.h" // duplicated defines in TM4C129ENCPDT.h
#include <inc/hw_types.h>
#include <driverlib/flash.h>
#include <driverlib/fpu.h>
#include <driverlib/gpio.h>
#include <driverlib/interrupt.h>
#include <driverlib/pin_map.h>
#include <driverlib/rom.h>
#include <driverlib/rom_map.h>
#include <driverlib/sysctl.h>
#include <driverlib/systick.h>
#include <driverlib/uart.h>

#include <net/EthernetAddress.h>

// FatFS.
#include "ff.h"

#include "inc/Button.h"
#include "inc/GPIO.h"
#include "inc/PortPin.h"

#include "FatFSDisk.h"
#include "SDC.h"
#include "SPIMasterDev.h"
#include "DS3234.h"
#include "TB6612.h"

#include "Display_AOs.h"
#include "Logging_AOs.h"
//#include "BLE_AOs.h"
#include "LwIP_AOs.h"
#include "LwIP_Events.h"
#include "PFPP_AOs.h"
#include "RTCC_AOs.h"

#include "PFPP_Events.h"
#include "Signals.h"
#include "IBSP.h"
#include "BSP.h"

#include "netif/tm4c129/EthDrv.h"

#ifdef USE_UART0
#include "uartstdio.h"
#endif // USE_UART0

#ifdef USE_RTT
// SEGGER RTT.
#include <SEGGER_RTT.h>
#endif // USE_RTT

#ifdef Q_SPY
#if !defined(USE_UART0) && !defined(USE_RTT)
#error Must define USE_UART0 or USE_RTT for using Q_SPY
#endif
#endif // Q_SPY

// *****************************************************************************
//                      DEFINED CONSTANTS AND MACROS
// *****************************************************************************


// !!!!!!!!!!!!!!!!!!!!!!!!!!!!! CAUTION !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// Assign a priority to EVERY ISR explicitly by calling NVIC_SetPriority().
// DO NOT LEAVE THE ISR PRIORITIES AT THE DEFAULT VALUE!
// See NOTE00
enum KernelUnawareISRs {
    UART0_PRIO,
    // ...
    // Keep always last.
    MAX_KERNEL_UNAWARE_CMSIS_PRI
};


// "kernel-unaware" interrupts can't overlap "kernel-aware" interrupts.
Q_ASSERT_COMPILE(MAX_KERNEL_UNAWARE_CMSIS_PRI <= QF_AWARE_ISR_CMSIS_PRI);

// See NOTE00.
enum KernelAwareISRs {
    SYSTICK_PRIO = QF_AWARE_ISR_CMSIS_PRI,
    GPIOPORTA_PRIO,
    GPIOPORTE_PRIO,
    //GPIOPORTF_PRIO,
    // ...
    // Keep always last.
    MAX_KERNEL_AWARE_CMSIS_PRI
};

// "kernel-aware" interrupts should not overlap the PendSV priority.
Q_ASSERT_COMPILE(MAX_KERNEL_AWARE_CMSIS_PRI <= (0xFF >>(8-__NVIC_PRIO_BITS)));

static constexpr uint32_t sClkRate{120000000U};
static constexpr unsigned long sUartPortNbr{0UL};
static constexpr uint32_t sUartBaudRate{115200U};

enum RTTTerminal {
    _stdin = 0,
    _stdout = 1,
    _stderr = 2,
    _qspy = 3,
};
static constexpr unsigned int sRTTBufferIndex{0U};
static constexpr size_t sRTTUpBufferSize{1024};
static constexpr unsigned int sRTTQSPYTerminal{RTTTerminal::_qspy};

#ifdef Q_SPY

static constexpr size_t sUARTTxFIFODepth{16U};

#endif // Q_SPY

// *****************************************************************************
//                         TYPEDEFS AND STRUCTURES
// *****************************************************************************

namespace BSP {


struct SSIGPIO {
    uint32_t mClkPinCfg;
    uint32_t mDat0PinCfg;
    uint32_t mDat1PinCfg;
    unsigned long mPort;
    unsigned int mClkPin;
    unsigned int mRxPin;
    unsigned int mTxPin;
};


class SSIPinCfg final
    : public CoreLink::SSIPinCfg {
public:
    explicit constexpr SSIPinCfg(
        unsigned int const aSSIID,
        struct SSIGPIO const &aSSIGPIO
    ) noexcept
        : CoreLink::SSIPinCfg(aSSIID), mSSIGPIO{aSSIGPIO} {}

    void SetPins(void) const override {
        GPIO::EnableSysCtlPeripheral(mSSIGPIO.mPort);
        MAP_GPIOPinConfigure(mSSIGPIO.mClkPinCfg);
        MAP_GPIOPinConfigure(mSSIGPIO.mDat0PinCfg);
        MAP_GPIOPinConfigure(mSSIGPIO.mDat1PinCfg);
        MAP_GPIOPinTypeSSI(
            mSSIGPIO.mPort,
            mSSIGPIO.mClkPin | mSSIGPIO.mRxPin | mSSIGPIO.mTxPin
        );

        // Set a weak pull-up on MISO pin for SD Card's proper operation.
        MAP_GPIOPadConfigSet(
            mSSIGPIO.mPort,
            mSSIGPIO.mRxPin,
            GPIO_STRENGTH_2MA,
            GPIO_PIN_TYPE_STD_WPU
        );

        MAP_GPIOPadConfigSet(
            mSSIGPIO.mPort,
            mSSIGPIO.mClkPin | mSSIGPIO.mTxPin,
            GPIO_STRENGTH_2MA,
            GPIO_PIN_TYPE_STD
        );
    }

private:
    struct SSIGPIO mSSIGPIO;
};


class Factory final
    : public IBSPFactory {

public:
    explicit Factory(uint32_t const aClkRate = sClkRate)
        : mClkRate(aClkRate)
        , mSPI2Dev(nullptr)
        , mSPI3Dev(nullptr)
        , mRTCC(nullptr)
        , mRTCCAO(nullptr)
        , mFileLogSinkAO(nullptr)
        , mPFPPAO(nullptr)
        , mDisplayMgrAO(nullptr)
        , mSDCDefault(nullptr)
        , mSDCBoosterPack(nullptr)
    {
        // Ctor.
        Init();

        // SPIMasterDev is required with several devices.
        CreateSPIDev(2);
        CreateSPIDev(3);
        // TODO: CONSIDER CREATING RTCC HERE TOO.
    }


    // IBSPFactory Interface.
    std::shared_ptr<RTCC::AO::RTCC_AO> StartRTCCAO(
        std::shared_ptr<CalendarRec> const &aCalendarRec,
        uint8_t const aPrio,
        QP::QEvt const * aQSto[],
        uint32_t const aQLen
    ) final {
        if (mRTCCAO == nullptr) {
            mRTCC = CreateRTCC();
            // RTCC also implements both ITemperature and INVMem interfaces.
            mRTCCAO = std::make_shared<RTCC::AO::RTCC_AO>(mRTCC, mRTCC, mRTCC, aCalendarRec);
            if (mRTCCAO != nullptr) {
                mRTCCAO->start(aPrio, aQSto, aQLen, nullptr, 0U);
            }
        }
        return mRTCCAO;
    }


    unsigned int CreateDisks(void) {
        // This BSP has one or two SDC devices.
        if (mSDCDefault == nullptr) {
            // Drive index 0 is the default drive.
            static constexpr auto sDriveIndex{0};
            static constexpr struct PortPin sCSnPin{GPIOD_AHB_BASE, GPIO_PIN_4};
            static constexpr struct PortPin sDetectPin{GPIOF_AHB_BASE, GPIO_PIN_7};
            mSDCDefault = std::make_unique<SDC>(
                sDriveIndex,
                mSPI3Dev,
                GPIO{sCSnPin.mPort, sCSnPin.mPin},
                GPIO{sDetectPin.mPort, sDetectPin.mPin}
            );
        }

        if (mSDCBoosterPack == nullptr) {
            // Sharp 128x128 memory LCD & microSD card BoosterPack.
            // Card detect line requires 0Ohm resistor.
            static constexpr auto sDriveIndex{1};
            static constexpr struct PortPin sCSnPin{GPIOC_AHB_BASE, GPIO_PIN_7};
            static constexpr struct PortPin sDetectPin{GPIOP_BASE, GPIO_PIN_2};
            mSDCBoosterPack = std::make_unique<SDC>(
                sDriveIndex,
                mSPI2Dev,
                GPIO{sCSnPin.mPort, sCSnPin.mPin},
                GPIO{sDetectPin.mPort, sDetectPin.mPin}
            );
        }

        return FatFSDisk::GetDiskQty();
    }


