smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
    [[maybe_unused]] bool MountFS(void) final {
        // Create SDC instance to use in FS stubs.
        // WARNING: if SD card disks exist, they should be mounted before calling
        // any other device triggering SPI bus activity.
        // This can be handled in different order when SDCard socket is
        // powered via PIO, but it's not guaranteed the case on all targets.
        // See http://elm-chan.org/docs/mmc/mmc_e.html
        // Section: Consideration on Multi-slave Configuration
        unsigned int const lDiskQty = CreateDisks();
        if (0 != lDiskQty) {
            // Disks found: mount the default drive.
            static constexpr auto sDefaultDiskIndex{0};
            FRESULT const lResult = FatFSDisk::StaticMountDisk(sDefaultDiskIndex, &mFatFS);
            if (FR_OK == lResult) {
                return true;
            }
        }

        // No disk found, or failed to mount default disk.
        return false;
    }


    [[maybe_unused]] bool StartFileSinkAO(
        uint8_t const aPrio,
        QP::QEvt const * aQSto[],
        uint32_t const aQLen
    ) final {
        // FS mounted on default disk: add log sink.
        if (mFileLogSinkAO == nullptr) {
            mFileLogSinkAO = std::make_unique<Logging::AO::FileSink_AO>(10 * 60 * BSP::TICKS_PER_SEC);
            if (mFileLogSinkAO != nullptr) {
                reinterpret_cast<Logging::AO::FileSink_AO * const>(
                    mFileLogSinkAO.get())->SetSyncLogLevel(LogLevel::prio::INFO);

                std::unordered_set<std::string> const lCategories{"PFPP"};
                Logging::Event::Init const lFileLogInitEvent(DUMMY_SIG, lCategories);
                mFileLogSinkAO->start(
                    aPrio,
                    aQSto,
                    aQLen,
                    nullptr,
                    0U,
                    &lFileLogInitEvent
                );
                return true;
            }
        }
        return false;
    }


    [[maybe_unused]] bool StartPFPPAO(
        std::shared_ptr<FeedCfgRec> const &aFeedCfgRec,
        uint8_t const aPrio,
        QP::QEvt const * aQSto[],
        uint32_t const aQLen
    ) final {
        if (mPFPPAO == nullptr) {
            // Create motor controller and pass ownership to Mgr_AO.
            auto lMotorControl = CreateMotorControl();
            mPFPPAO = std::make_unique<PFPP::AO::Mgr_AO>(
                std::move(lMotorControl),
                aFeedCfgRec
            );
            if (mPFPPAO != nullptr) {
                mPFPPAO->start(aPrio, aQSto, aQLen, nullptr, 0U);
                return true;
            }
        }
        return false;
    }


    [[maybe_unused]] bool StartDisplayMgrAO(
        uint8_t const aPrio,
        QP::QEvt const * aQSto[],
        uint32_t const aQLen
    ) final {
        if (mDisplayMgrAO == nullptr) {
            // TODO: CREATE AN ACTUAL OBJECT WHEN AVAILABLE.
            mDisplayMgrAO = std::unique_ptr<Display::AO::Mgr_AO>(nullptr);
            if (mDisplayMgrAO != nullptr) {
                mDisplayMgrAO->start(aPrio, aQSto, aQLen, nullptr, 0U);
                return true;
            }
        }
        return false;
    }


    [[maybe_unused]] bool StartLwIPMgrAO(
        uint8_t const aPrio,
        QP::QEvt const * aQSto[],
        uint32_t const aQLen,
        QP::QEvt const * const aInitEvt
    ) final {
        if (mLwIPMgrAO == nullptr) {
            // Create all Ethernet drivers required before the AO.
            // LwIP::AO::Mgr doesn't use any local references to LwIPDrv.
            // They are referenced via LwIPDrv static functions.
            CreateEthDrv();
            mLwIPMgrAO = std::make_unique<LwIP::AO::Mgr_AO>();
            if (mLwIPMgrAO != nullptr) {
                mLwIPMgrAO->start(aPrio, aQSto, aQLen, nullptr, 0U, aInitEvt);
                return true;
            }
        }
        return false;
    }


    std::shared_ptr<QP::QActive> CreateBLEAO(void) final {
        return nullptr;//std::make_shared<QP::QActive>(nullptr);//std::shared_ptr<PFPP::AO::BLE_AO>(nullptr);
    }


    // Local interface.
    static constexpr struct PortPin GetRTCCInterruptPin(void) { return mRTCCInterruptPin; }
    //static GPIO const &GetBLEInterruptPin(void) { return mBLEInterruptPin; }

    static uint8_t const sSysTick_Handler;
    static uint8_t const sGPIOPortP3_IRQHandler;

private:
    void Init(void) {
        // NOTE: SystemInit() already called from the startup code,
        // where clock already set (CLOCK_SETUP in lm3s_config.h)
        // SystemCoreClockUpdate() also called from there.
        // Settings done for 50MHz system clock.

        mClkRate = SysCtlClockFreqSet(
            SYSCTL_XTAL_25MHZ
                | SYSCTL_OSC_MAIN
                | SYSCTL_USE_PLL
                | SYSCTL_CFG_VCO_480,
            mClkRate
        );

        // Floating point unit.
        MAP_FPUEnable();
        MAP_FPULazyStackingEnable();

        // Enable the clock to the peripherals used by the application.

        // Enable all required GPIO.
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOH);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOP);

#ifdef USE_UART0
        // Debug UART port.
        static constexpr struct PortPin lU0RxGPIO{GPIOA_AHB_BASE, GPIO_PIN_0};
        static constexpr struct PortPin lU0TxGPIO{GPIOA_AHB_BASE, GPIO_PIN_1};
        MAP_GPIOPinConfigure(GPIO_PA0_U0RX);
        MAP_GPIOPinConfigure(GPIO_PA1_U0TX);
        MAP_GPIOPinTypeUART(
            lU0RxGPIO.mPort,
            lU0RxGPIO.mPin | lU0TxGPIO.mPin
        );
        // Enable UART0:
        // @115200, 8-N-1.
        // Flush the buffers.
        UARTStdioInit(sUartPortNbr, mClkRate, sUartBaudRate);
#endif // USE_UART0

#ifdef USE_RTT
    // Leave here until RTT has other use than QSPY.
    SEGGER_RTT_Init();
    static constexpr auto sRTTUpBufferName{"RTTUpBuffer"};
    static uint8_t sRTTUpBuffer[sRTTUpBufferSize]{0};
    int lResult = SEGGER_RTT_ConfigUpBuffer(
        sRTTBufferIndex,
        sRTTUpBufferName,
        &sRTTUpBuffer[0],
        sizeof(sRTTUpBufferSize),
        SEGGER_RTT_MODE_NO_BLOCK_SKIP
    );

    if (lResult < 0) {
        // Error while configuring buffer.
        return;
    }

    static constexpr auto sRTTDownBufferName{"RTTDownBuffer"};
    static constexpr size_t sRTTDownBufferSize{64};
    static uint8_t sRTTDownBuffer[sRTTDownBufferSize]{0};
    lResult = SEGGER_RTT_ConfigDownBuffer(
        sRTTBufferIndex,
        sRTTDownBufferName,
        &sRTTDownBuffer[0],
        sizeof(sRTTDownBufferSize),
        SEGGER_RTT_MODE_NO_BLOCK_SKIP
    );

    if (lResult < 0) {
        // Error while configuring buffer.
        return;
    }

    //ITM_SendChar("Hello, World!\n");
    // TODO: HAS TO BE ENABLED FIRST.
    //ITM_SendChar('M');
#endif // USE_RTT

#ifdef Q_SPY
#ifdef USE_UART0
        // Enable interrupts.
        // Interrupt on rx FIFO half-full.
        // UART interrupts: rx and rx-to.
        MAP_UARTIntDisable(UART0_BASE, 0xFFFFFFFF);
        MAP_UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
        MAP_IntEnable(INT_UART0);
#endif // USE_UART0

        // Initialize the QS software tracing.
        if (0U == QS_INIT(nullptr)) {
            Q_ERROR();
        }
        QS_OBJ_DICTIONARY(&BSP::Factory::sSysTick_Handler);
        QS_OBJ_DICTIONARY(&sGPIOPortP3_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortC_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortD_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortF_IRQHandler);

        QS_OBJ_DICTIONARY(mPFPPAO.get());
        QS_OBJ_DICTIONARY(mLwIPMgrAO.get());
#endif // Q_SPY
    }


    void CreateSPIDev(unsigned int aSSIID) {
        switch (aSSIID) {
        case 2: {
            // Create pin configuration.
            // Initialize SPI Master.
            SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI2);
            static constexpr SSIPinCfg lSSIPinCfg{
                2,
                {
                    GPIO_PD3_SSI2CLK,
                    GPIO_PD1_SSI2XDAT0,
                    GPIO_PD0_SSI2XDAT1,
                    GPIOD_AHB_BASE,
                    GPIO_PIN_3, // Clk.
                    GPIO_PIN_0, // Rx.
                    GPIO_PIN_1  // Tx.
                }
            };
            mSPI2Dev = std::make_shared<CoreLink::SPIMasterDev>(
                SSI2_BASE,
                mClkRate,
                lSSIPinCfg
            );
        } break;
        case 3: {
            // Create pin configuration.
            // Initialize SPI Master.
            SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI3);
            static constexpr SSIPinCfg lSSIPinCfg{
                3,
                {
                    GPIO_PQ0_SSI3CLK,
                    GPIO_PQ2_SSI3XDAT0,
                    GPIO_PQ3_SSI3XDAT1,
                    GPIOQ_BASE,
                    GPIO_PIN_0, // Clk.
                    GPIO_PIN_3, // Rx.
                    GPIO_PIN_2  // Tx.
                }
            };
            mSPI3Dev = std::make_shared<CoreLink::SPIMasterDev>(
                SSI3_BASE,
                mClkRate,
                lSSIPinCfg
            );
        } break;
        case 0: [[fallthrough]];
        case 1: [[fallthrough]];
        default:
            return;
        }
    }


    std::shared_ptr<DS3234> CreateRTCC(void) {
        // Creates a DS3234 RTCC.
        // Reset input pin.
        [[maybe_unused]] static constexpr struct PortPin sResetPin{
            GPIOK_BASE,
            GPIO_PIN_7
        };
        // Calls the Ctor that uses default SPI slave configuration,
        // with specified CSn pin.
        static constexpr unsigned long sInterruptNumber{INT_GPIOP3};
        static constexpr struct PortPin sCSnPin{GPIOQ_BASE, GPIO_PIN_1};
        auto lRTCC = std::make_shared<DS3234>(
            2000,
            sInterruptNumber,
            GPIO{mRTCCInterruptPin.mPort, mRTCCInterruptPin.mPin},
            mSPI3Dev,
            GPIO{sCSnPin.mPort, sCSnPin.mPin}
        );

        return lRTCC;
    }


    std::unique_ptr<IMotorControl> CreateMotorControl(void) {
        static constexpr struct PortPin lIn1{GPIOB_AHB_BASE, GPIO_PIN_6};
        static constexpr struct PortPin lIn2{GPIOB_AHB_BASE, GPIO_PIN_5};
        static constexpr struct PortPin lPWM{GPIOB_AHB_BASE, GPIO_PIN_0};

        // In fact, creates *half* a TB6612.
        return std::make_unique<TB6612>(
            GPIO{lIn1.mPort, lIn1.mPin},
            GPIO{lIn2.mPort, lIn2.mPin},
            GPIO{lPWM.mPort, lPWM.mPin}
        );
    }


    void CreateEthDrv(void) {
        static constexpr unsigned int sMyNetIFIndex{0};
        EthernetAddress const lMAC = GetMACAddress();
        static constexpr unsigned int sPBufQueueSize{8};
        mEthDrv = std::make_unique<EthDrv>(
            sMyNetIFIndex,
            lMAC,
            sPBufQueueSize,
            mClkRate
        );
    }


