smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
#if 0
    std::unique_ptr<BLE::BLE> CreateBLE(void) {
        unsigned long lInterruptNumber = INT_GPIOB;
        static constexpr GPIO lCSnPin(GPIOB_AHB_BASE, GPIO_PIN_4);
        auto lBLE = std::make_unique<BLE::BLE>(
            lInterruptNumber,
            mBLEInterruptPin,
            *mSPI3Dev,
            lCSnPin
        );

        return lBLE;
    }
#endif


    EthernetAddress GetMACAddress(void) {
        // For the Stellaris Eval Kits, the MAC address will be stored in the
        // non-volatile USER0 and USER1 registers. These registers can be read
        // using the FlashUserGet function, as illustrated below.
        unsigned long lUser0{0};
        unsigned long lUser1{0};
        FlashUserGet(&lUser0, &lUser1);

        // Convert the 24/24 split MAC address from NV ram into a 32/16 split MAC address.
        EthernetAddress const lMAC(
            static_cast<uint8_t>((lUser0 & 0x000000FFL) >>  0),
            static_cast<uint8_t>((lUser0 & 0x0000FF00L) >>  8),
            static_cast<uint8_t>((lUser0 & 0x00FF0000L) >> 16),
            static_cast<uint8_t>((lUser1 & 0x000000FFL) >>  0),
            static_cast<uint8_t>((lUser1 & 0x0000FF00L) >>  8),
            static_cast<uint8_t>((lUser1 & 0x00FF0000L) >> 16)
        );

        if (lMAC.IsValid()) {
            return lMAC;
        }

        static constexpr EthernetAddress sDefaultMAC{
            0x00, 0x50, 0x1d, 0xc2, 0x70, 0xff
        };
        return sDefaultMAC;
    }

    uint32_t mClkRate;
    std::shared_ptr<CoreLink::SPIMasterDev> mSPI2Dev;
    std::shared_ptr<CoreLink::SPIMasterDev> mSPI3Dev;
    std::shared_ptr<DS3234> mRTCC;
    std::shared_ptr<RTCC::AO::RTCC_AO> mRTCCAO;
    std::unique_ptr<Logging::AO::FileSink_AO> mFileLogSinkAO;
    std::unique_ptr<PFPP::AO::Mgr_AO> mPFPPAO;
    std::unique_ptr<Display::AO::Mgr_AO> mDisplayMgrAO;
    std::unique_ptr<SDC> mSDCDefault;
    std::unique_ptr<SDC> mSDCBoosterPack;
    std::unique_ptr<EthDrv> mEthDrv;
    std::unique_ptr<LwIP::AO::Mgr_AO> mLwIPMgrAO;
    //std::unique_ptr<BLE::BLE> mBLE;
    //std::shared_ptr<PFPP::AO::BLE_AO> mBLEAO;

    static constexpr struct PortPin mRTCCInterruptPin{GPIOP_BASE, GPIO_PIN_3};
    //static constexpr GPIO mBLEInterruptPin{GPIOB_AHB_BASE, GPIO_PIN_1};

    FATFS mFatFS{0};
};


} // namespace BSP

// *****************************************************************************
//                            FUNCTION PROTOTYPES
// *****************************************************************************

namespace BSP {
static void InitEtherLED(void);
static void InitUserLED(struct PortPin const &aUserLEDPortPin);
static void SetUserLED(struct PortPin const &aUserLEDPortPin);
static void ClrUserLED(struct PortPin const &aUserLEDPortPin);
} // namespace BSP

#ifdef Q_SPY
static void TxData(void);
#endif // Q_SPY

// *****************************************************************************
//                             GLOBAL VARIABLES
// *****************************************************************************

static time_t sSystemTime{0};

#ifdef Q_SPY
// For local extern "C" functions, not part of any namespace.
static QP::QSTimeCtr QS_tickTime_{0};
static QP::QSTimeCtr const QS_tickPeriod_{SystemCoreClock / BSP::TICKS_PER_SEC};

namespace BSP {
    // event-source identifiers used for tracing
    uint8_t const Factory::sSysTick_Handler{0U};
    uint8_t const Factory::sGPIOPortP3_IRQHandler{0U};
}

#endif // Q_SPY


// Button class should become GPIO class.
//GPIO const BSP::Factory::mBLEInterruptPin(GPIOB_AHB_BASE, GPIO_PIN_1);


namespace BSP {

// Those variables are used locally in various stubs and IRQ handlers.
static Button const mManualFeedButton(GPIOJ_AHB_BASE, GPIO_PIN_0, INT_GPIOJ, 0);
static Button const mTimedFeedButton(GPIOJ_AHB_BASE, GPIO_PIN_1, INT_GPIOJ, 0);

static constexpr PortPin sUserLED1PortPin{GPION_BASE, GPIO_PIN_1};
static constexpr PortPin sUserLED2PortPin{GPION_BASE, GPIO_PIN_0};
} // namespace BSP

// *****************************************************************************
//                            EXPORTED FUNCTIONS
// *****************************************************************************

namespace BSP {

std::unique_ptr<IBSPFactory> Create(void) {
    return std::make_unique<Factory>();
}


}  // namespace BSP

// *****************************************************************************
//                              LOCAL FUNCTIONS
// *****************************************************************************

namespace BSP {


static void InitEtherLED(void) {

    // GPIO for Ethernet LEDs.
    static constexpr PortPin lLinkLEDPortPin{GPIOF_AHB_BASE, GPIO_PIN_4};
    MAP_GPIOPinTypeGPIOOutput(lLinkLEDPortPin.mPort, lLinkLEDPortPin.mPin);
    MAP_GPIOPadConfigSet(
        lLinkLEDPortPin.mPort,
        lLinkLEDPortPin.mPin,
        GPIO_STRENGTH_2MA,
        GPIO_PIN_TYPE_STD
    );
    MAP_GPIOPinConfigure(GPIO_PF4_EN0LED1);
    MAP_GPIOPinTypeEthernetLED(lLinkLEDPortPin.mPort, lLinkLEDPortPin.mPin);

    static constexpr PortPin lActivityLEDPortPin{GPIOF_AHB_BASE, GPIO_PIN_0};
    MAP_GPIOPinTypeGPIOOutput(lActivityLEDPortPin.mPort, lActivityLEDPortPin.mPin);
    MAP_GPIOPadConfigSet(
        lActivityLEDPortPin.mPort,
        lActivityLEDPortPin.mPin,
        GPIO_STRENGTH_2MA,
        GPIO_PIN_TYPE_STD
    );
    MAP_GPIOPinConfigure(GPIO_PF0_EN0LED0);
    MAP_GPIOPinTypeEthernetLED(lActivityLEDPortPin.mPort, lActivityLEDPortPin.mPin);

    MAP_IntEnable(INT_EMAC0);
}


static void InitUserLED(struct PortPin const &aUserLEDPortPin) {
    // GPIO for user LED toggling during idle.
    MAP_GPIOPinTypeGPIOOutput(aUserLEDPortPin.mPort, aUserLEDPortPin.mPin);
    MAP_GPIOPadConfigSet(
        aUserLEDPortPin.mPort,
        aUserLEDPortPin.mPin,
        GPIO_STRENGTH_2MA,
        GPIO_PIN_TYPE_STD
    );
}


static void SetUserLED(struct PortPin const &aUserLEDPortPin) {

    MAP_GPIOPinWrite(
        aUserLEDPortPin.mPort,
        aUserLEDPortPin.mPin,
        aUserLEDPortPin.mPin
    );
}


static void ClrUserLED(struct PortPin const &aUserLEDPortPin) {

    MAP_GPIOPinWrite(
        aUserLEDPortPin.mPort,
        aUserLEDPortPin.mPin,
        0
    );
}

} // namespace BSP


// QF callbacks ==============================================================
void QP::QF::onStartup(void) {

    // Set up the SysTick timer to fire at BSP_TICKS_PER_SEC rate
    // !!! SysCtlClockGet can not be used for tm4c129 !!!
    // Using constant here assumes SysCtlClockFreqSet() was successful.
    // This is better handled in the lm3s6965 port.
    MAP_SysTickPeriodSet(sClkRate / BSP::TICKS_PER_SEC);
    MAP_IntPrioritySet(FAULT_SYSTICK, 0x80); //SYSTICK_PRIO
    MAP_SysTickIntEnable();
    MAP_SysTickEnable();

