smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
        QF_INT_DISABLE();
        // Get next block to transmit.
        uint8_t const *lBlockPtr = QS::getBlock(&lFIFOLen);
        QF_INT_ENABLE();

        // Any bytes in the block?
        while (lFIFOLen-- != 0U) {
            // Put into the FIFO.
            MAP_UARTCharPut(UART0_BASE, *lBlockPtr++);
        }
    }

#elif defined(USE_RTT)
    // TX done?
    unsigned int lAvailWriteSpace = SEGGER_RTT_GetAvailWriteSpace(sRTTBufferIndex);
    if (lAvailWriteSpace > 0) {
        // Max bytes we can accept.
        uint16_t lBlockLen = lAvailWriteSpace;

        QF_INT_DISABLE();
        // Get pointer to next block to transmit.
        uint8_t const *lBlockPtr = QP::QS::getBlock(&lBlockLen);
        QF_INT_ENABLE();

        while (lBlockLen != 0U) {
            //SEGGER_RTT_SetTerminal(sRTTQSPYTerminal);
            unsigned int lWrittenLen = SEGGER_RTT_Write(sRTTBufferIndex, lBlockPtr, lBlockLen);
            //SEGGER_RTT_SetTerminal(0);
            if (lBlockLen <= lWrittenLen) {
                lBlockLen -= lWrittenLen;
                lBlockPtr += lWrittenLen;
            } else {
                lBlockLen = 0;
            }
        }
    }
#endif
}

#endif // Q_SPY


extern "C" {

// LwIP
u32_t sys_now() {
    // Returns the current time in milliseconds.
    return SysTickValueGet() * BSP::MS_PER_TICK;
}


void sntp_set_system_time(time_t aTime) {
    sSystemTime = aTime;

    // Send event with new system time from SNTP.
    LwIP::Event::SystemTimeUpdate * const lEvent = Q_NEW(
        LwIP::Event::SystemTimeUpdate,
        LWIP_SYSTEM_TIME_UPDATE_SIG,
        aTime
    );
#ifdef Q_SPY
    static QP::QSpyId const sSNTPSetSystemTime{0U};
#endif // Q_SPY
    QP::QF::PUBLISH(lEvent, &sSNTPSetSystemTime);
}

static void DebounceSwitches(void) {

    static constexpr std::size_t sStateDepth{5};
    static std::array<int32_t, sStateDepth> sPinsState{0};
    static int32_t sPreviousDebounce{0};
    static std::size_t lStateIx{0};
    sPinsState[lStateIx] = ~MAP_GPIOPinRead(GPIOJ_AHB_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    lStateIx++;
    if (lStateIx >= sStateDepth) {
        lStateIx = 0;
    }

    // Bitwise-AND all last current pin states.
    int32_t lCurrentDebounce{GPIO_PIN_0 | GPIO_PIN_1};
    for (auto const lPinState : sPinsState) {
        lCurrentDebounce &= lPinState;
    }

#ifdef Q_SPY
    static QP::QSpyId const sSysTick_Handler{0U};
#endif // Q_SPY
    // What changed now? Look for pressed states.
    if ((!sPreviousDebounce) & lCurrentDebounce) {
        if (lCurrentDebounce & GPIO_PIN_0) {
            BSP::SetUserLED(BSP::sUserLED2PortPin);
            static PFPP::Event::Mgr::ManualFeedCmd const sOnEvent(
                FEED_MGR_MANUAL_FEED_CMD_SIG,
                true
            );
            QP::QF::PUBLISH(&sOnEvent, &sSysTick_Handler);
        }
        if (lCurrentDebounce & GPIO_PIN_1) {
            static PFPP::Event::Mgr::TimedFeedCmd const sOnEvent(
                FEED_MGR_TIMED_FEED_CMD_SIG,
                true
            );
            QP::QF::PUBLISH(&sOnEvent, &sSysTick_Handler);
        }
    }

    // Look for released states.
    if (sPreviousDebounce & !lCurrentDebounce) {
        if (!lCurrentDebounce & GPIO_PIN_0) {
            BSP::ClrUserLED(BSP::sUserLED2PortPin);
            static PFPP::Event::Mgr::ManualFeedCmd const sOffEvent(
                FEED_MGR_MANUAL_FEED_CMD_SIG,
                false
            );
            QP::QF::PUBLISH(&sOffEvent, &sSysTick_Handler);
        }
    }

    sPreviousDebounce = lCurrentDebounce;
}


void SysTick_Handler(void);
void SysTick_Handler(void) {

#ifdef Q_SPY
    {
        // Clear SysTick_CTRL_COUNTFLAG.
        // Account for the clock rollover.
        //uint32_t volatile lTmp = SysTick->CTRL;
        //static_cast<void>(lTmp);
        QS_tickTime_ += QS_tickPeriod_;
    }
#endif // Q_SPY

    // Call QF Tick function.
    QP::QF::TICK_X(0U, &BSP::Factory::sSysTick_Handler);

    // Uncomment those lines if need to publish every single tick.
    // Process time events for rate 0.
    // Publish to subscribers.
    //static constexpr QP::QEvt sTickEvent{
    //    TIME_TICK_SIG,
    //    QP::QEvt::StaticEvt::STATIC_EVT
    //};
    //QP::QF::PUBLISH(&sTickEvent, &sSysTick_Handler);

    DebounceSwitches();
}


// GPIO port P interrupt handler.
void GPIOPortP3_IRQHandler(void);
void GPIOPortP3_IRQHandler(void) {

    // Get the state of the GPIO and issue the corresponding event.
    static constexpr bool sIsMasked{true};
    constexpr struct PortPin lRTCCInterruptPin = BSP::Factory::GetRTCCInterruptPin();
    unsigned long lIntStatus = MAP_GPIOIntStatus(lRTCCInterruptPin.mPort, sIsMasked);
    //constexpr unsigned long lPort = lRTCCInterruptPin.mPort;
    constexpr unsigned int lPin = lRTCCInterruptPin.mPin;
    if (lPin & lIntStatus) {
        MAP_GPIOIntClear(lRTCCInterruptPin.mPort, lPin);

        // Signal to AO that RTCC generated an interrupt.
        // This can be done with direct POST to known RTCC AO, but since there's a single instance,
        // broadcasting the event/signal is just fine too.
        static QP::QEvt constexpr sRTCCAlarmIntEvent{
            RTCC_INTERRUPT_SIG,
            QP::QEvt::StaticEvt::STATIC_EVT
        };
#ifdef Q_SPY
        static QP::QSpyId const sGPIOPortP3_IRQHandler{0U};
#endif // Q_SPY
        QP::QF::PUBLISH(&sRTCCAlarmIntEvent, &sGPIOPortP3_IRQHandler);
    }
}


// GPIO port B interrupt handler.
#if 0
void GPIOPortB_IRQHandler(void);
void GPIOPortB_IRQHandler(void) {
    // Get the state of the GPIO and issue the corresponding event.
    static const bool lIsMasked{true};
    unsigned long lIntStatus = MAP_GPIOIntStatus(GPIOB_AHB_BASE, lIsMasked);
    unsigned int lPin = BSP::Factory::GetBLEInterruptPin().GetPin();
    if (lPin & lIntStatus) {
        MAP_GPIOIntClear(GPIOB_AHB_BASE, lPin);

        // Signal to AO that BLE generated an interrupt.
        static QP::QEvt const sBLEIntEvent(BLE_INTERRUPT_SIG);
        //QP::QF::PUBLISH(&sBLEIntEvent, 0);
        BSP::Factory::Instance()->GetOpaqueBLEAO()->POST(&sBLEIntEvent, 0);
    }
}
#endif

#if 0
// GPIO port J interrupt handler.
void GPIOPortJ_IRQHandler(void);
void GPIOPortJ_IRQHandler(void) {
}


// GPIO port D interrupt handler.
void GPIOPortD_IRQHandler(void);
void GPIOPortD_IRQHandler(void) {

}
#endif


#if defined(Q_SPY) && defined (USE_UART0)
void UART0_IRQHandler(void);
// ISR for receiving bytes from the QSPY Back-End
// NOTE: This ISR is "QF-unaware" meaning that it does not interact with
// the QF/QK and is not disabled.
// Such ISRs don't need to call QK_ISR_ENTRY/QK_ISR_EXIT
// and they cannot post or publish events.
//
void UART0_IRQHandler(void) {
    // Get the raw interrupt status.
    // Clear the asserted interrupts.
    unsigned long lStatus = MAP_UARTIntStatus(UART0_BASE, true);
    MAP_UARTIntStatus(UART0_BASE, lStatus);

    // While RX FIFO NOT empty.
    while (MAP_UARTCharsAvail(UART0_BASE)) {
        unsigned long lLongByte = MAP_UARTCharGet(UART0_BASE);
        uint8_t lByte = static_cast<uint8_t>(lLongByte);
        QP::QS::rxPut(lByte);
    }
}
#else // Q_SPY
// Intentional undefined function body.
#endif // Q_SPY


// TODO: make this conditional to Ethernet support.
void EMAC0_IRQHandler(void);
void EMAC0_IRQHandler(void) {
    LwIPDrv::StaticISR(0);
}


} // extern C

// *****************************************************************************
//                                END OF FILE
// *****************************************************************************
